# GetLayerDeltaZOffset

## Description
Returns the wall height's offset to the layer delta z.

```pascal
FUNCTION GetLayerDeltaZOffset(theWall : HANDLE) : REAL;
```

```python

def vs.GetLayerDeltaZOffset(theWall):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|

## See Also
VS Functions:
SetLayerDeltaZOffset

## Version
```diff
- GetLayerDeltaZOffset is obsolete as of Vectorworks 2012
```

Availability: from VectorWorks12.5
## Category
* Objects - Walls